Repository: ntd/adg
Catalog: po/*.po
Languages: it

source: Display version information
it: Stampa le informazioni sulla versione

source: Show the boundary boxes of every entity
it: Mostrare il riquadro contenitore di ogni entità

source: - ADG demonstration program
it: - Programma dimostrativo della ADG

source: Error from adg-demo
it: Errore da adg-demo

source: Requested format not supported
it: Formato richiesto non supportato

source: adg-demo.ui not found!
it: adg-demo.ui non trovato!

source: adg-demo - Demostration program
it: adg-demo - Programma dimostrativo

source: About adg-demo
it: Informazioni su adg-demo

source: Demonstration program for the ADG library
it: Programma dimostrativo della libreria ADG

source: The ADG library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License for more details. You should have received a copy of the GNU Lesser General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
it: La libreria ADG è software libero; puoi ridistribuirla e/o modificarla secondo i termini della GNU Lesser General Public License così come pubblicata dalla Free Software Foundation; sia la versione 2 della licenza o (a tua scelta) qualsiasi versione successiva. Questa libreria è distribuita nella speranza che sia utile, ma SENZA ALCUNA GARANZIA; nemmeno con la garanzia di VIABILITÀ SUL MERCATO o di APPROPRIATEZZA PER UN PARTICOLARE FINE. Per maggiori dettagli, vedere il testo originale in inglese. Dovresti aver ricevuto una copia della GNU Lesser General Public License insieme a questa libreria; in caso contrario, scrivere a Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.

source: Customize drawing
it: Impostazioni disegno

source: _Diameter rail:
it: _Diametro guida:

source: _Total length:
it: Lunghezza _totale:

source: _B quote:
it: Quota _B:

source: Diameter _2:
it: Diametro _2:

source: Length 2:
it: Lunghezza 2:

source: Diameter _3:
it: Diametro _3:

source: Diameter _4:
it: Diametro _4:

source: Length 3:
it: Lunghezza 3:

source: <b>Body data</b>
it: <b>Dati corpo</b>

source: _Head diameter:
it: Diametro _testa:

source: Head tickness:
it: Spessore testa:

source: Tablet diameter:
it: Diametro pastiglia:

source: Cham_fered head
it: Testa sm_ussata

source: _Rounded head
it: Testa _raggiata

source: Head radius:
it: Raggio testa:

source: <b>Head data</b>
it: <b>Dati testa</b>

source: Hole diameter:
it: Diametro foro:

source: Hole depth:
it: Profondità foro:

source: <b>Rear hole data</b>
it: <b>Dati foratura</b>

source: Groove machining
it: Lavorazione scarico

source: Groove position:
it: Posizione scarico:

source: Groove diameter:
it: Diametro scarico:

source: Groove thickness:
it: Spessore scarico:

source: <b>Additional machinings</b>
it: <b>Lavorazioni aggiuntive</b>

source: Dimensions
it: Dimensioni

source: _Title:
it: _Titolo:

source: SAMPLE DRAWING
it: DISEGNO CAMPIONE

source: _Drawing:
it: D_isegno:

source: EXAMPLE
it: ESEMPIO

source: A_uthor:
it: _Autore:

source: D_ate:
it: _Data:

source: <b>Metadata</b>
it: <b>Metadati</b>

source: Title block
it: Riquadro delle intestazioni

source: Help on adg-demo
it: Aiuto di adg-demo

source: How to use adg-demo
it: Come usare adg-demo

source: This demo is just a sample of what can be accomplished by using the ADG library. It is by no means intended to be the only kind of application possible. To better see the differences between local and global space, some mouse interaction is needed: <b>rotate</b> the mouse wheel to zoom in and out in local space, <b>drag it</b> with the wheel pressed to pan and keep the <b>shift pressed</b> while zooming and panning to do the same in global space. A <b>left click</b> on the drawing area will restore the paper zoom and position, a <b>right click</b> will autoscale and center the drawing.
it: Questo dimostrativo è solo un esempio di ciò che può essere sviluppato usando la libreria ADG. Non è assolutamente da considerare il solo tipo di applicazione possibile. Per vedere meglio le differenze tra spazio globale e locale, è necessario interagire con il mouse: <b>ruotare</b> la rotellina per ingrandire o rimpicciolire nello spazio locale, <b>trascinare</b> con la rotellina premuta per traslare e tenere il tasto <b>maiuscolo premuto</b> durante l'ingrandimento, il rimpicciolimento o la traslazione per eseguire le medesime operazioni nello spazio globale. Un <b>click sinistro</b> nell'area di disegno ripristinerà ingrandimento e posizione del foglio, un <b>click destro</b> autoscalerà e centrerà il disegno.

source: Save current drawing
it: Salva disegno corrente

source: Guessed from e_xtension
it: Rileva dall'e_stensione

source: PNG _image
it: _Immagine PNG

source: S_VG image
it: Immagine S_VG

source: P_DF document
it: Documento P_DF

source: _PostScript file
it: File _PostScript

source: <b>File format</b>
it: <b>Formato file</b>

source: cpml-demo.ui not found!
it: cpml-demo.ui non trovato!

source: - CPML demonstration program
it: - Programma dimostrativo della CPML

source: Unable to get arc info (%lf, %lf) (%lf, %lf) (%lf, %lf)
it: Impossibile elaborare l'arco (%lf, %lf) (%lf, %lf) (%lf, %lf)

source: <b>Browsing</b> Primitives and segments
it: <b>Navigazione</b> Primitive e segmenti

source: <b>Arcs</b> Native support for arcs and circles
it: <b>Archi</b> Supporto nativo per archi e cerchi

source: <b>Intersections</b> Geometrical helper functions
it: <b>Intersezioni</b> Funzioni geometriche di supporto

source: <b>Offset curves</b> Test bed for cubic Bézier offset
it: <b>Offset curve</b> Banco prova per l'offset delle Bézier cubiche

source: <b>Offset segments</b> Offseting complex segments
it: <b>Offset segmenti</b> Offset di segmenti complessi

source: Pages
it: Pagine

source: <b>Browsing subject:</b>
it: <b>Soggetto navigazione:</b>

source: Browsing
it: Navigazione

source: Arcs
it: Archi

source: Intersections
it: Intersezioni

source: <b>Offset algorithm:</b>
it: <b>Algoritmo di offset:</b>

source: Offset curves
it: Curve parallele

source: Offset segments
it: Segmenti paralleli

source: Invalid arguments: arg[0] not set
it: Argomenti non validi: arg[0] è vuoto

source: First Origin
it: Prima Origine

source: Where the first line comes from: this point is used toghether with "ref1" to align the first extension line
it: Da dove arriva la prima linea: questo punto è usato insieme a "ref1" per allineare la prima linea di estensione

source: Second Origin
it: Seconda Origine

source: Where the second line comes from: this point is used toghether with "ref2" to align the second extension line
it: Da dove arriva la seconda linea: questo punto è usato insieme a "ref2" per allineare la seconda linea di estensione

source: Has First Extension Line flag
it: Flag di Prima Linea di Estensione Presente

source: Show (TRUE) or hide (FALSE) the first extension line
it: Mostrare (TRUE) o nascondere (FALSE) la prima linea di estensione

source: Has Second Extension Line flag
it: Flag di Seconda Linea di Estensione Presente

source: Show (TRUE) or hide (FALSE) the second extension line
it: Mostrare (TRUE) o nascondere (FALSE) la seconda linea di estensione

source: Trying to set an angular dimension on parallel lines
it: Si è provato a quotare con un angolo due linee parallele

source: Factor
it: Fattore

source: Portion of extents, either in x and y, the content will be displaced: a (0.5, 0.5) factor means the origin is the middle point of the extents
it: Frazione dell'estensione, sia in x che in y, ove il contenuto sarà posizionato: per esempio, usando (0.5, 0.5) l'origine si troverà al centro dell'esetensione

source: Arrow Angle
it: Angolo Freccia

source: The opening angle of the arrow
it: L'angolo di apertura della freccia

source: Canvas Size
it: Dimensione Canvas

source: The size set on this canvas: use 0 to have an automatic dimension based on the canvas extents
it: La dimensione impostata per questo canvas: usare 0 per abilitare il dimensionamento automatico basato sui limiti del canvas

source: Global space units per point (1 point == 1/72 inch)
it: Unità spazio globale per punto (1 punto == 1/72 di pollice)

source: Valid Scales
it: Scale Valide

source: List of scales to be tested while autoscaling the drawing
it: Elenco di scale da provare durante l'autoscalatura del disegno

source: Background Dress
it: Vestito Sfondo

source: The color dress to use for the canvas background
it: Il vestito colore da usare come sfondo per il canvas

source: Frame Dress
it: Vestito Riquadro

source: Line dress to use while drawing the frame around the canvas
it: Vesito linea da usare durante il rendering della cornice del canvas

source: Title Block
it: Blocco delle Iscrizioni

source: The title block to assign to this canvas
it: Il blocco delle iscrizioni da allegare a questo canvas

source: Top Margin
it: Margine Superiore

source: The margin (in global space) to leave above the frame
it: Lo spazio (in global space) da lasciare sopra la cornice

source: Right Margin
it: Margine Destro

source: The margin (in global space) to leave empty at the right of the frame
it: Lo spazio (in global space) da lasciare alla destra della cornice

source: Bottom Margin
it: Margine Inferiore

source: The margin (in global space) to leave empty below the frame
it: Lo spazio (in global space) da lasciare vuoto sotto la cornice

source: Left Margin
it: Margine Sinistro

source: The margin (in global space) to leave empty at the left of the frame
it: Lo spazio (nello spazio globale) da lasciare vuoto alla sinistra della cornice

source: Has Frame Flag
it: Flag di Riquadro Presente

source: If enabled, a frame using the frame dress will be drawn around the canvas extents, taking into account the margins
it: Se abilitato verrà disegnata una cornice, usando vestito cornice, attorno ai limiti dal canvas tenendo in considerazione i margini

source: Top Padding
it: Spaziatura Superiore

source: The padding (in global space) to leave empty above between the drawing and the frame
it: La spaziatura (in global space) da lasciare vuota sopra tra il disegno e la cornice

source: Right Padding
it: Spaziatura Destra

source: The padding (in global space) to leave empty at the right between the drawing and the frame
it: La spaziatura (in global space) da lasciare vuota a destra tra il disegno e la cornice

source: Bottom Padding
it: Spaziatura Inferiore

source: The padding (in global space) to leave empty below between the drawing and the frame
it: La spaziatura (in global space) da lasciare vuota a sotto tra il disegno e la cornice

source: Left Padding
it: Spaziatura Sinistra

source: The padding (in global space) to leave empty at the left between the drawing and the frame
it: La spaziatura (in global space) da lasciare vuota a sinistra tra il disegno e la cornice

source: Red Channel
it: Canale Rosso

source: The red value, where 0 means no red and 1 is full red
it: Quantità di rosso, dove 0 significa assenza di rosso e 1 rosso pieno

source: Green Channel
it: Canale Verde

source: The green value, where 0 means no green and 1 is full green
it: Quantità di verde, dove 0 significa assenza di verde e 1 verde pieno

source: Blue Channel
it: Canale Blu

source: The blue value, where 0 means no blue and 1 is full blue
it: Quantità di blu, dove 0 significa assenza di blu e 1 blu pieno

source: Alpha Channel
it: Canale Alfa

source: The alpha value, where 0 means completely transparent and 1 is fully opaque
it: Il valore alfa, dove 0 significa totalmente trasparente e 1 completamente opaco

source: Child
it: Figlio

source: Can be used to add a new child to the container
it: Può essere usato per aggiungere una nuova entità al contenitore

source: %s: signal '%s' is invalid for instance %p
it: %s: segnale '%s' non valido per l'oggetto %p

source: Attempting to add an entity with type %s to a container of type %s, but the entity is already inside a container of type %s
it: Si è provato ad aggiungere una entità di tipo %s ad un contenitore di tipo %s ma l'entità è già all'interno di un contenitore di tipo %s

source: Attempting to remove an entity with type %s from a container of type %s, but the entity is not present
it: Si è provato ad eliminare una entità di tipo %s da un contenitore di tipo %s ma l'entità non è presente

source: Dimension Dress
it: Vestito Dimensione

source: The dress to use for rendering this dimension
it: Il vestito da usare per il rendering di questa dimensione

source: First Reference
it: Primo Riferimento

source: First reference point of the dimension
it: Primo punto di riferimento della dimensione

source: Second Reference
it: Secondo Riferimento

source: Second reference point of the dimension
it: Secondo punto di riferimento della dimensione

source: Position
it: Posizione

source: The reference position of the quote: it will be combined with "level" to get the real quote position
it: Il punto di riferimento per il posizionamento della quota: sarà combinato con il "level" per ottenere la posizione reale della quota

source: Level
it: Livello

source: The dimension level, that is the factor to multiply the baseline spacing (defined in the dimension style) to get the offset from pos where the quote should be rendered
it: Il livello della dimensione, ossia il fattore per moltiplicare la spaziatura tra le linee base (definito nello stile della dimensione) per ottenere l'offset dal punto di posizionamento dove la quota dovrebbe essere riportata

source: Outside
it: Esterna

source: Whether the arrows must be inside the extension lines (ADG_THREE_STATE_OFF), must be extended outside the extension lines (ADG_THREE_STATE_ON) or should be automatically handled depending on the available space
it: Specifica se le freccie devono stare all'interno delle linee di estensione (ADG_THREE_STATE_OFF), devono estendersi all'esterno delle linee di estensione (ADG_THREE_STATE_ON) oppure questa decisione viene gestita automaticamente in base allo spazio disponibile

source: Detached Quote
it: Quota Distaccata

source: Where the quote must be positioned: in the middle of the base line (ADG_THREE_STATE_OFF), near the pos point (ADG_THREE_STATE_ON) or should be automatically deducted depending on the available space
it: Dove deve essere posizionata la quota: nel mezzo della linea di base (ADG_THREE_STATE_OFF), vicino al punto di posizionamento (ADG_THREE_STATE_ON) oppure se questa decisione è subordinata allo spazio disponibile

source: Value Template
it: Template Valore

source: The template string to be used for generating the set value of the quote
it: La stringa di template da usare per generare il valore nominale della quota

source: Minimum Value or Low Tolerance
it: Valore Minimo o Tolleranza Inferiore

source: The minimum value allowed or the lowest tolerance from value (depending of the dimension style): set to NULL to suppress
it: Il valore minimo ammesso o la tolleranza inferiore dal valore nominale (a seconda dello stile dimensione): impostare a NULL per disattivarlo

source: Maximum Value or High Tolerance
it: Valore Massimo o Tolleranza Superiore

source: The maximum value allowed or the highest tolerance from value (depending of the dimension style): set to NULL to suppress
it: Il valore massimo ammesso o la tolleranza superiore dal valore nominale (a seconda dello stile dimensione): impostare a NULL per disattivarlo

source: '%s' is missing
it: '%s' assente

source: '%s' and '%s' cannot be coincident (%lf, %lf)
it: '%s' e '%s' non possono essere coincidenti (%lf, %lf)

source: AdgDim::compute_geometry not implemented for '%s'
it: AdgDim::compute_geometry non implementata per '%s'

source: AdgDim::default_value not implemented for '%s'
it: AdgDim::default_value non implementato da '%s'

source: First Marker
it: Primo Contrassegno

source: The template entity to use as first marker
it: L'entità guida da usare per il primo contrassegno

source: Second Marker
it: Secondo Contrassegno

source: The template entity to use as second marker
it: L'entità guida da usare per il secondo contrassegno

source: Color Dress
it: Vestito Colore

source: Color dress for the whole dimension
it: Vestito colore da usare per l'intera dimensione

source: Value Dress
it: Vestito Valore

source: Font dress for the nominal value of the dimension
it: Vestito del font per il valore nominale della dimensione

source: Minimum Limit Dress
it: Vestito Limite Minimo

source: Font dress for the lower limit value
it: Vestito del font per il valore limite basso

source: Maximum Limit Dress
it: Vestito Limite Massimo

source: Font dress for the upper limit value
it: Vestito del font per il valore limite alto

source: Line Dress
it: Vestito Linea

source: Line dress for the baseline and the extension lines
it: Vestito della linea di quotatura e delle linee di estensione

source: From Offset
it: Distanza Da

source: Offset (in global space) of the extension lines from the path to the quote
it: Distanza (nello spazio globale) tra la linea di estensione e la forma da quotare

source: To Offset
it: Distanza A

source: How many extend (in global space) the extension lines after hitting the baseline
it: Quanto allungare (nello spazio globale) le linee di estensione oltre la linea di quotatura

source: Beyond Length
it: Lunghezza Oltre

source: How much the baseline should be extended (in global space) beyond the extension lines on dimensions with outside markers
it: Quanto la linea di quotatura si può allungare (nello spazio globale) oltre le linee di estensione nelle dimensioni con contrassegni esterni

source: Baseline Spacing
it: Distanza Linee di Quotatura

source: Distance between two consecutive baselines while stacking dimensions
it: Distanza tra due linee di quotatura nelle dimensioni sovrapposte

source: Limits Spacing
it: Spaziatura Limiti

source: Distance between limits/tolerances
it: Distanza tra i limiti/tolleranze

source: Quote Shift
it: Spiazzamento Quota

source: Used to specify a smooth displacement (in global space) of the quote by taking as reference the perfect compact position (the middle of the baseline on common linear dimension, for instance)
it: Usato per specificare un piccolo scostamento (in global space) della quota con riferimento alla posizione compatta ideale (nelle comuni dimensioni lineari, la metà della linea di base, per esempio)

source: Limits Shift
it: Scostamento dei Limiti

source: Used to specify a smooth displacement (in global space) for the limits/tolerances by taking as reference the perfect compact position
it: Usato per specificare un piccolo scostamento (in global space) per le tolleranze/limiti prendendo come riferimento la posizione compatta ideale

source: Number Format
it: Formato Numero

source: The format (in printf style) of the numeric component of the basic value
it: Il formato (in modalità printf) del componente numerico della quota nominale

source: Number Arguments
it: Argomenti Numero

source: The arguments to pass to the format function: see adg_dim_style_set_number_arguments() for further details
it: Gli argomenti da passare alla funzione di formattazione: vedere adg_dim_style_set_number_arguments() per maggiori dettagli

source: Number Tag
it: Tag di Quota

source: The tag to substitute inside the value template string
it: Il tag da sostituire all'interno della stringa template del valore

source: Rounded Value Decimals
it: Decimali Valore Arrotondato

source: Number of significant decimals to use in the format string for rounded values (-1 to disable)
it: Numero di decimali significativi da usare come formato formato per i valori arrotondati (-1 per disabilitare)

source: Raw Value Decimals
it: Decimali Valore Originale

source: Number of significant decimals the raw value must be rounded to (-1 to disable)
it: Numero di decimali significativi a cui il valore originale deve essere arrotondato (-1 per disabilitare)

source: %s: the fallback style of '%s' dress (%d) must be a '%s' derived type, but a '%s' has been provided
it: %s: lo stile implicito del vestito '%s' (%d) deve essere un tipo derivato da '%s' mentre è stato fornito un '%s'

source: Source
it: Originale

source: The source from which the edges should be computed from
it: L'originale da dove ottenere le linee spigolo

source: Axis Angle
it: Angolo Asse

source: The angle of the axis of the source trail: it is implied this axis passes through (0,0)
it: L'angolo dellasse dell'originale: è sottinteso che questo asse passerà per (0;0)

source: Critical Angle
it: Angolo Critico

source: The angle that defines which corner generates an edge (if the corner angle is greater than this critical angle) and which edge is ignored
it: L'angolo che definisce quando considerare uno spigolo (se l'angolo dello spigolo è maggiore di questo valore) e quando ignorarlo

source: Floating Entity
it: Entità Flottante

source: Flag that includes (FALSE) or excludes (TRUE) this entity from the computation of the parent entity extents
it: Impostazione per includere (FALSE) o escludere (TRUE) questa entità dal calcolo dell'estensione del genitore

source: Parent Entity
it: Entità Genitore

source: The parent entity of this entity or NULL if this is a top-level entity
it: L'entità che contiene questa entità o NULL se l'entità corrente è una top-level

source: Global Map
it: Trasformazione Globale

source: The transformation to be combined with the parent ones to get the global matrix
it: La trasformazione da combinare insieme a quelle dei progenitori per ottenere la matrice globale

source: Local Map
it: Trasformazione Locale

source: The local transformation that could be used to compute the local matrix in the way specified by the #AdgEntity:local-mix property
it: La trasformazione locale che può venir usata per calcolare la matrice locale nella modalità specificata dalla proprietà #AdgEntity:local-method

source: Local Mix Method
it: Metodo di Combinazione Locale

source: Define how the local maps of the entity and its ancestors should be combined to get the local matrix
it: Specifica come le trasformazioni locali dell'entità corrente e dei suoi progenitori devono essere combinate per ottenere la matrice locale

source: %s: '%s' is not compatible with '%s' for '%s' dress (%d)
it: %s: '%s' non è compatibile con '%s' per il vestito '%s' (%d)

source: %s: requested to mix the maps using an undefined mix method
it: %s: metodo di combinazione delle trasformazioni sconosciuto

source: %s: 'arrange' method not implemented for type '%s'
it: %s: metodo 'arrange' non implementato per il tipo '%s'

source: %s: 'render' method not implemented for type '%s'
it: %s: metodo 'render' non implementato per il tipo '%s'

source: The cairo pattern set for this entity
it: Il pattern cairo impostato per questa entità

source: %s: pattern undefined for type '%s'
it: %s: è stato richiesto un segmento indefinito per il tipo '%s'

source: The fallback color dress to bind to this style
it: Il vestito colore implicito da associare a questo stile

source: Font Family
it: Famiglia di Font

source: The font family name, encoded in UTF-8
it: Il nome della famiglia di font, codificata in UTF-8

source: Font Slant
it: Slant del Font

source: Variant of a font face based on its slant
it: Variante del font basato sullo slant

source: Font Weight
it: Spessore del Font

source: Variant of a font face based on its weight
it: Variante del font basato sul suo spessore

source: Font Size
it: Dimensione Font
