Repository: ntd/adg
Catalog: po/*.po
Languages: it

source: Font size in user space units
it: Dimensione del font nello spazio utente

source: Font Antialiasing Mode
it: Modalità di Antialiasing del Font

source: Type of antialiasing to do when rendering text
it: Tipo di antialiasing da applicare durante il disegno del testo

source: Font Subpixel Order
it: Ordine di Subpixel del Font

source: The order of color elements within each pixel on the display device when rendering with subpixel antialiasing mode
it: Ordine di colori all'interno di ogni pixel del display durante il disegno del testo con modalità di antialiasing subpixel abilitata

source: Type of Hinting
it: Tipo di Hinting

source: How outlines must fit to the pixel grid in order to improve the glyph appearance
it: Come il bordo deve adattarsi alla griglia di pixel per migliorare l'apparenza del segno

source: Font Metric Hinting
it: Metrica di Hinting del Font

source: Whether to hint font metrics, that is align them to integer values in device space
it: Specifica se adottare l'hint metrico, ossia se applicare l'allineamento a valori interi nello spazio dispositivo

source: The canvas to be shown
it: Il canvas da mostrare

source: The factor to use while zooming in and out (usually with the mouse wheel)
it: Il fattore da usare per ingrandire (di solito con la rotella del mouse) avanti e indietro

source: When enabled, automatically adjust the zoom in global space at every size allocation
it: Quando abilitato, corregge automaticamente l'ingrandimento in global space ad ogni nuovo cambiamento di dimensione

source: Render Map
it: Mappa di Render

source: The transformation to be applied on the canvas before rendering it
it: La trasformazione da applicare al canvas prima del rendering

source: Horizontal adjustment
it: Regolazione orizzontale

source: The GtkAdjustment that determines the values of the horizontal position for this viewport
it: Il GtkAdjustment che specifica il valore della posizione orizzontale di questa viewport

source: Vertical adjustment
it: Regolazione verticale

source: The GtkAdjustment that determines the values of the vertical position for this viewport
it: Il GtkAdjustment che specifica il valore della posizione verticale di questa viewport

source: Fill Dress
it: Vestito Riempimento

source: The dress to use for filling this entity
it: Il vestito da usare per riempire questa entità

source: Direction
it: Direzione

source: The inclination angle of the extension lines
it: L'angolo di inclinazione delle linee di estensione

source: The color dress to bind to this line style
it: Il vestito colore da allegare a questo stile di linea

source: Line Width
it: Spessore Linea

source: The line thickness in device unit
it: Lo spessore della linea in unità device

source: Line Cap
it: Terminazione Linea

source: The line cap mode
it: La modalità di terminazione della linea

source: Line Join
it: Unione Linee

source: The line join mode
it: La modalità di unione delle linee

source: Miter Limit
it: Limite Punta

source: Whether the lines should be joined with a bevel instead of a miter
it: Quando le linee devono essere unite da un trapezio invece che da un triangolo

source: Antialiasing Mode
it: Modalità di Antialiasing

source: Type of antialiasing to do when rendering lines
it: Tipo di antialiasing da applicare durante il rendering delle linee

source: Dash Pattern
it: Pattern Tratteggio

source: The dash pattern to be used while stroking a path
it: Il pattern del tratteggio da usare durante il disegno di un path

source: Symbol Dress
it: Vestito Simbolo

source: The line dress to use for rendering the symbol of the logo
it: Il vestito da usare per il disegno delle linee del simbolo del logo

source: Screen Dress
it: Vestito Schermo

source: The line dress to use for rendering the screen shape around the logo
it: Il vestito da usare per il disegno delle linee della forma attorno al logo

source: The line dress to use for rendering the frame
it: Il vestito da usare per disegnare le linee del riquadro

source: Trail
it: Scia

source: The subject AdgTrail for this marker
it: L'AdgTrail soggetto per questo indicatore

source: Segment Index
it: Indice del Segmento

source: The segment on trail where this marker should be applied (where 0 means undefined segment, 1 the first segment and so on)
it: Il segmento dell'AdgTrail dove questo indicatore dovrebbe essere applicato (dove 0 significa nessun segmento, 1 il primo segmento e così via)

source: The position ratio inside the segment where to put the marker (0 means the start point while 1 means the end point)
it: Il ratio di posizione all'interno del segmento dove inserire l'indicatore (0 significa punto iniziale mentre 1 significa punto finale)

source: Marker Size
it: Dimensione Indicatore

source: The size (in global space) of the marker
it: La dimensione (in global space) dell'indicatore

source: Model
it: Modello

source: A general purpose model usable by the marker implementations
it: Un modello ad uso generale usato dall'implementazione dell'indicatore

source: %s: 'create_model' method not implemented for type '%s'
it: %s: 'create_model' non implementato per il tipo '%s'

source: %s: normalization of anamorphic matrices not supported
it: %s: normalizzazione di matrici anamorfiche non supportata

source: Dependency
it: Dipendenza

source: Can be used to add a new dependency from this model (this entity will be invalidated on model changed)
it: Può essere usato per aggiungere una nuova dipendenza da questo modello (questa entità sarà invalidata quando cambia il modello)

source: %s: attempting to remove the nonexistent dependency on the entity with type %s from a model of type %s
it: %s: si è provato ad eliminare un'inesistente dipendenza da un'entità di tipo %s in un modello di tipo %s

source: %s: attempting to remove nonexistent '%s' named pair
it: %s: si è provato ad eliminare l'inesistente named pair '%s'

source: Spacing
it: Distanza

source: Amount of spacing between lines on multiline text
it: Quantità di spazio tra le linee di un testo multilinea

source: Unhandled slant value (%d)
it: Valore di slant inatteso (%d)

source: Unhandled weight value (%d)
it: Valore di weight inatteso (%d)

source: %s: null pair caught while parsing arguments
it: %s: rilevato un named pair nullo durante l'analisi degli argomenti

source: %s: the axis of the reflection is not known
it: %s: l'asse di riflessione non è conosciuta

source: %s: a '%s' operation is still active while clearing the path
it: %s: operazione '%s' ancora attiva durante l'azzeramento del path

source: %s: requested a '%s' operation on a path without current primitive
it: %s: richiesta l'operazione '%s' su un path senza primitiva attiva

source: %s: requested a '%s' operation while a '%s' operation was active
it: %s: richiesta l'operazione '%s' mentre l'operazione '%s' era in corso

source: %s: %d path operation not recognized
it: %s: l'operazione %d non è conosciuta

source: %s: first chamfer delta of %lf is greather than the available %lf length
it: %s: il primo delta dello smusso %lf è maggiore dello spazio disponibile %lf

source: %s: second chamfer delta of %lf is greather than the available %lf length
it: %s: il secondo delta dello smusso %lf è maggiore dello spazio disponibile %lf

source: %s: fillet with radius of %lf is not applicable here
it: %s: un raccordo di raggio %lf non è eseguibile ora

source: %s: trying to get a pair from an undefined point
it: %s: si è provato ad ottenere le coordinate da un punto indefinito

source: The line dress to use for rendering the views of the projection
it: Il vestito linea da usare per il rendering delle viste della proiezione

source: Axis Dress
it: Vestito Assi

source: The line dress to use for rendering the axis of the projection scheme
it: Il vestito linea da usare per il rendering degli assi della proiezione

source: Projection Scheme
it: Proiezione Ortografica

source: The projection scheme to be represented
it: Il tipo di proiezione ortografica da adottare

source: Dress to be used for rendering the lines
it: Vestito da usare per disegnare le linee

source: The spacing in global spaces between the lines
it: La distanza nello spazio globale tra le linee

source: Angle
it: Angolo

source: The angle (in radians) of the lines
it: L'angolo (in radianti) delle linee

source: The dress to use for stroking this entity
it: Il vestito da usare per tracciare questa entità

source: The trail to be stroked
it: La scia da tracciare

source: %s: 'apply' method not implemented for type '%s'
it: %s: metodo 'arrange' non implementato per il tipo '%s'

source: Table Dress
it: Vestito Tabella

source: If enabled, a frame using the proper dress found in this table style will be drawn around the table extents
it: Se abilitato, un riquadro attorno alla tabella verrà disegnato usando il vestito specificato dallo stile della tabella stessa

source: Fallback color dress, used when no specific dresses are selected
it: Vestito colore implicito, da usare quando nessun altro vestito è stato specificato

source: Grid Dress
it: Vestito Griglia

source: Line dress to use while rendering the grid of the table
it: Vestito da usare per tracciare la griglia della tabella

source: Line dress to use while drawing the table frame
it: Vestito da usare per tracciare il riquadro della tabella

source: Title Dress
it: Vestito Titolo

source: Font dress to use for titles
it: Vestito del font da usare per il titolo

source: Font dress to use for values inside the cells
it: Vestito del font da usare per scrivere il valore all'interno delle celle

source: Row Height
it: Altezza Riga

source: Cell Padding
it: Spaziatura Celle

source: How much space from the bounding box must left inside every cell
it: Quanto spazio lasciare vuoto all'interno di ogni cella

source: Cell Spacing
it: Distanza Celle

source: How much space to left between the cells
it: Quanto spazio lasciare vuoto tra le celle

source: Text
it: Testo

source: The text associated to this entity
it: Il testo associato a questa entità

source: Font Dress
it: Vestito del Font

source: The font dress to use for rendering this text
it: Il vestito del font da usare per disegnare questo testo

source: %s: 'set_font_dress' method not implemented for type '%s'
it: %s: metodo 'set_font_dress' non implementato per il tipo '%s'

source: %s: 'get_font_dress' method not implemented for type '%s'
it: %s: metodo 'get_font_dress' non implementato per il tipo '%s'

source: %s: 'set_text' method not implemented for type '%s'
it: %s: metodo 'set_text' non implementato per il tipo '%s'

source: %s: 'dup_text' method not implemented for type '%s'
it: %s: metodo 'dup_text' non implementato per il tipo '%s'

source: Title
it: Titolo

source: A descriptive title of the drawing
it: Un titolo descrittivo del disegno

source: Drawing Name
it: Nome Disegno

source: The name of the drawing: the ADG canvas does not make any assumtpion on this text string
it: Il nome del disegno: il canvas ADG non avanza alcuna ipotesi sul significato di questa stringa

source: Media Size
it: Dimensione del Supporto

source: The media size to be used to print the drawing, usually something like "A3" or "Letter"
it: La dimensione del supporto usato per stampare il disegno, solitamente una stringa tipo "A3" o "Letter"

source: Scale
it: Scala

source: The scale of the drawing, if it makes sense
it: La scala del disegno, se significativa

source: Author
it: Autore

source: Name and last name of the author of the drawing
it: Nome e cognome dell'autore del disegno

source: Date
it: Data

source: The date this drawing has been generated: setting it to an empty string will fallback to today in the preferred representation for the current locale
it: La data di generazione disegno: impostandola ad una stringa vuota, la data verrà inizializzata automaticamente ad oggi nel formato privilegiato dalle impostazioni di localizzazione correnti

source: An entity to be displayed in the title block as the logo of the owner: the containing cell has a 1:1 ratio
it: L'entità da mostrare nel riquadro delle iscrizioni come logo del proprietario: la cella contenitrice ha un ratio 1:1

source: The entity usually reserved to identify the projection scheme adopted by this drawing
it: Entità solitamente riservata per identificare il tipo di proiezione ortografica usata in questo disegno

source: TITLE
it: TITOLO

source: SIZE
it: FOGLIO

source: SCALE
it: SCALA

source: DRAWING
it: DISEGNO

source: AUTHOR
it: AUTORE

source: DATE
it: DATA

source: Unable to build glyphs (cairo message: %s)
it: Non riesco a generare i glifi (messaggio da cairo: %s)

source: Max Angle
it: Angolo Massimo

source: Max arc angle to approximate with a single Bezier curve: check adg_trail_set_max_angle() for details
it: Massimo angolo di arco da approssimare con una singola linea di Bézier: consultare adg_trail_set_max_angle() per dettagli

source: %s: you cannot access the path from the callback you provided to build it
it: %s: accesso al path non consentito dalla funzione che deve definirlo

source: %s: requested undefined segment for type '%s'
it: %s: è stato richiesto un segmento indefinito per il tipo '%s'

source: %s: invalid path data
it: %s: dati del path non validi

source: %s: callback not defined for instance of type '%s'
it: %s: callback non definita per un'istanza di tipo '%s'
